FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_nvmctrl.h
/**
 * \file
 *
 * \brief Component description for NVMCTRL
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_NVMCTRL_COMPONENT_
#define _SAMD20_NVMCTRL_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR NVMCTRL */
/* ========================================================================== */
/** \addtogroup SAMD20_NVMCTRL Non-Volatile Memory Controller */
/*@{*/

#define REV_NVMCTRL    0x102

/* -------- NVMCTRL_CTRLA : (NVMCTRL Offset: 0x00) (R/W 16) NVM Control Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t CMD : 7;   /*!< bit:  0.. 6  Command                            */
            uint16_t : 1;       /*!< bit:      7  Reserved                           */
            uint16_t CMDEX : 8; /*!< bit:  8..15  Command Execution                  */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } NVMCTRL_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_CTRLA_OFFSET         0x00        /**< \brief (NVMCTRL_CTRLA offset) NVM Control Register A */
#define NVMCTRL_CTRLA_RESETVALUE     0x0000      /**< \brief (NVMCTRL_CTRLA reset_value) NVM Control Register A */

#define NVMCTRL_CTRLA_CMD_Pos        0           /**< \brief (NVMCTRL_CTRLA) Command */
#define NVMCTRL_CTRLA_CMD_Msk        ( 0x7Fu << NVMCTRL_CTRLA_CMD_Pos )
#define NVMCTRL_CTRLA_CMD( value )    ( ( NVMCTRL_CTRLA_CMD_Msk & ( ( value ) << NVMCTRL_CTRLA_CMD_Pos ) ) )
#define   NVMCTRL_CTRLA_CMD_ER       ( 0x2u << 0 )  /**< \brief (NVMCTRL_CTRLA) Erase Row */
#define   NVMCTRL_CTRLA_CMD_WP       ( 0x4u << 0 )  /**< \brief (NVMCTRL_CTRLA) Write Page */
#define   NVMCTRL_CTRLA_CMD_EAR      ( 0x5u << 0 )  /**< \brief (NVMCTRL_CTRLA) Erase Auxiliary Row */
#define   NVMCTRL_CTRLA_CMD_WAP      ( 0x6u << 0 )  /**< \brief (NVMCTRL_CTRLA) Write  Auxiliary Row */
#define   NVMCTRL_CTRLA_CMD_SF       ( 0xAu << 0 )  /**< \brief (NVMCTRL_CTRLA) Security Flow Command */
#define   NVMCTRL_CTRLA_CMD_WL       ( 0xFu << 0 )  /**< \brief (NVMCTRL_CTRLA) Write lockbits */
#define   NVMCTRL_CTRLA_CMD_LR       ( 0x40u << 0 ) /**< \brief (NVMCTRL_CTRLA) Lock Region */
#define   NVMCTRL_CTRLA_CMD_UR       ( 0x41u << 0 ) /**< \brief (NVMCTRL_CTRLA) Unlock Region */
#define   NVMCTRL_CTRLA_CMD_SPRM     ( 0x42u << 0 ) /**< \brief (NVMCTRL_CTRLA) Set Power Reduction Mode */
#define   NVMCTRL_CTRLA_CMD_CPRM     ( 0x43u << 0 ) /**< \brief (NVMCTRL_CTRLA) Clear Power Reduction Mode */
#define   NVMCTRL_CTRLA_CMD_PBC      ( 0x44u << 0 ) /**< \brief (NVMCTRL_CTRLA) Page Buffer Clear */
#define   NVMCTRL_CTRLA_CMD_SSB      ( 0x45u << 0 ) /**< \brief (NVMCTRL_CTRLA) Set Security Bit */
#define   NVMCTRL_CTRLA_CMD_SMR      ( 0x54u << 0 ) /**< \brief (NVMCTRL_CTRLA) State Machine Reset */
#define NVMCTRL_CTRLA_CMDEX_Pos      8              /**< \brief (NVMCTRL_CTRLA) Command Execution */
#define NVMCTRL_CTRLA_CMDEX_Msk      ( 0xFFu << NVMCTRL_CTRLA_CMDEX_Pos )
#define NVMCTRL_CTRLA_CMDEX( value )    ( ( NVMCTRL_CTRLA_CMDEX_Msk & ( ( value ) << NVMCTRL_CTRLA_CMDEX_Pos ) ) )
#define   NVMCTRL_CTRLA_CMDEX_KEY    ( 0xA5u << 8 ) /**< \brief (NVMCTRL_CTRLA) Execution Key */
#define NVMCTRL_CTRLA_MASK           0xFF7Fu        /**< \brief (NVMCTRL_CTRLA) MASK Register */

/* -------- NVMCTRL_CTRLB : (NVMCTRL Offset: 0x04) (R/W 32) NVM Control Register B -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 1;          /*!< bit:      0  Reserved                           */
            uint32_t RWS : 4;      /*!< bit:  1.. 4  NVM Read Wait States               */
            uint32_t : 2;          /*!< bit:  5.. 6  Reserved                           */
            uint32_t MANW : 1;     /*!< bit:      7  Manual Write                       */
            uint32_t SLEEPPRM : 2; /*!< bit:  8.. 9  Power Reduction Mode during Sleep  */
            uint32_t : 6;          /*!< bit: 10..15  Reserved                           */
            uint32_t READMODE : 2; /*!< bit: 16..17  NVMCTRL Read Mode                  */
            uint32_t CACHEDIS : 1; /*!< bit:     18  Cache Disable                      */
            uint32_t : 13;         /*!< bit: 19..31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } NVMCTRL_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_CTRLB_OFFSET                      0x04       /**< \brief (NVMCTRL_CTRLB offset) NVM Control Register B */
#define NVMCTRL_CTRLB_RESETVALUE                  0x00000000 /**< \brief (NVMCTRL_CTRLB reset_value) NVM Control Register B */

#define NVMCTRL_CTRLB_RWS_Pos                     1          /**< \brief (NVMCTRL_CTRLB) NVM Read Wait States */
#define NVMCTRL_CTRLB_RWS_Msk                     ( 0xFu << NVMCTRL_CTRLB_RWS_Pos )
#define NVMCTRL_CTRLB_RWS( value )    ( ( NVMCTRL_CTRLB_RWS_Msk & ( ( value ) << NVMCTRL_CTRLB_RWS_Pos ) ) )
#define   NVMCTRL_CTRLB_RWS_SINGLE                ( 0x0u << 1 ) /**< \brief (NVMCTRL_CTRLB) Single Auto Wait State */
#define   NVMCTRL_CTRLB_RWS_HALF                  ( 0x1u << 1 ) /**< \brief (NVMCTRL_CTRLB) Half Auto Wait State */
#define   NVMCTRL_CTRLB_RWS_DUAL                  ( 0x2u << 1 ) /**< \brief (NVMCTRL_CTRLB) Dual Auto Wait State */
#define NVMCTRL_CTRLB_MANW_Pos                    7             /**< \brief (NVMCTRL_CTRLB) Manual Write */
#define NVMCTRL_CTRLB_MANW                        ( 0x1u << NVMCTRL_CTRLB_MANW_Pos )
#define NVMCTRL_CTRLB_SLEEPPRM_Pos                8             /**< \brief (NVMCTRL_CTRLB) Power Reduction Mode during Sleep */
#define NVMCTRL_CTRLB_SLEEPPRM_Msk                ( 0x3u << NVMCTRL_CTRLB_SLEEPPRM_Pos )
#define NVMCTRL_CTRLB_SLEEPPRM( value )    ( ( NVMCTRL_CTRLB_SLEEPPRM_Msk & ( ( value ) << NVMCTRL_CTRLB_SLEEPPRM_Pos ) ) )
#define   NVMCTRL_CTRLB_SLEEPPRM_WAKEONACCESS     ( 0x0u << 8 ) /**< \brief (NVMCTRL_CTRLB) Wake on first access. */
#define   NVMCTRL_CTRLB_SLEEPPRM_WAKEUPINSTANT    ( 0x1u << 8 ) /**< \brief (NVMCTRL_CTRLB) Wake on sleep exit. */
#define   NVMCTRL_CTRLB_SLEEPPRM_DISABLED         ( 0x3u << 8 ) /**< \brief (NVMCTRL_CTRLB) Auto power reduction disabled. */
#define NVMCTRL_CTRLB_READMODE_Pos                16            /**< \brief (NVMCTRL_CTRLB) NVMCTRL Read Mode */
#define NVMCTRL_CTRLB_READMODE_Msk                ( 0x3u << NVMCTRL_CTRLB_READMODE_Pos )
#define NVMCTRL_CTRLB_READMODE( value )    ( ( NVMCTRL_CTRLB_READMODE_Msk & ( ( value ) << NVMCTRL_CTRLB_READMODE_Pos ) ) )
#define NVMCTRL_CTRLB_CACHEDIS_Pos                18          /**< \brief (NVMCTRL_CTRLB) Cache Disable */
#define NVMCTRL_CTRLB_CACHEDIS                    ( 0x1u << NVMCTRL_CTRLB_CACHEDIS_Pos )
#define NVMCTRL_CTRLB_MASK                        0x0007039Eu /**< \brief (NVMCTRL_CTRLB) MASK Register */

/* -------- NVMCTRL_PARAM : (NVMCTRL Offset: 0x08) (R/W 32) Parameter Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t NVMP : 16; /*!< bit:  0..15  NVM Pages                          */
            uint32_t PSZ : 3;   /*!< bit: 16..18  Page Size                          */
            uint32_t : 13;      /*!< bit: 19..31  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } NVMCTRL_PARAM_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

