FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_nvmctrl.h
#define NVMCTRL_PARAM_OFFSET        0x08         /**< \brief (NVMCTRL_PARAM offset) Parameter Register */
#define NVMCTRL_PARAM_RESETVALUE    0x00000000   /**< \brief (NVMCTRL_PARAM reset_value) Parameter Register */

#define NVMCTRL_PARAM_NVMP_Pos      0            /**< \brief (NVMCTRL_PARAM) NVM Pages */
#define NVMCTRL_PARAM_NVMP_Msk      ( 0xFFFFu << NVMCTRL_PARAM_NVMP_Pos )
#define NVMCTRL_PARAM_NVMP( value )    ( ( NVMCTRL_PARAM_NVMP_Msk & ( ( value ) << NVMCTRL_PARAM_NVMP_Pos ) ) )
#define NVMCTRL_PARAM_PSZ_Pos       16           /**< \brief (NVMCTRL_PARAM) Page Size */
#define NVMCTRL_PARAM_PSZ_Msk       ( 0x7u << NVMCTRL_PARAM_PSZ_Pos )
#define NVMCTRL_PARAM_PSZ( value )     ( ( NVMCTRL_PARAM_PSZ_Msk & ( ( value ) << NVMCTRL_PARAM_PSZ_Pos ) ) )
#define NVMCTRL_PARAM_MASK          0x0007FFFFu  /**< \brief (NVMCTRL_PARAM) MASK Register */

/* -------- NVMCTRL_INTENCLR : (NVMCTRL Offset: 0x0C) (R/W  8) Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t READY : 1; /*!< bit:      0  NVM Ready Interrupt Disable        */
            uint8_t ERROR : 1; /*!< bit:      1  Error Interrupt Disable            */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } NVMCTRL_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_INTENCLR_OFFSET        0x0C      /**< \brief (NVMCTRL_INTENCLR offset) Interrupt Enable Clear Register */
#define NVMCTRL_INTENCLR_RESETVALUE    0x00      /**< \brief (NVMCTRL_INTENCLR reset_value) Interrupt Enable Clear Register */

#define NVMCTRL_INTENCLR_READY_Pos     0         /**< \brief (NVMCTRL_INTENCLR) NVM Ready Interrupt Disable */
#define NVMCTRL_INTENCLR_READY         ( 0x1u << NVMCTRL_INTENCLR_READY_Pos )
#define NVMCTRL_INTENCLR_ERROR_Pos     1         /**< \brief (NVMCTRL_INTENCLR) Error Interrupt Disable */
#define NVMCTRL_INTENCLR_ERROR         ( 0x1u << NVMCTRL_INTENCLR_ERROR_Pos )
#define NVMCTRL_INTENCLR_MASK          0x03u     /**< \brief (NVMCTRL_INTENCLR) MASK Register */

/* -------- NVMCTRL_INTENSET : (NVMCTRL Offset: 0x10) (R/W  8) Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t READY : 1; /*!< bit:      0  NVM Ready Interrupt Enable         */
            uint8_t ERROR : 1; /*!< bit:      1  Error Interrupt Enable             */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } NVMCTRL_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_INTENSET_OFFSET        0x10      /**< \brief (NVMCTRL_INTENSET offset) Interrupt Enable Set Register */
#define NVMCTRL_INTENSET_RESETVALUE    0x00      /**< \brief (NVMCTRL_INTENSET reset_value) Interrupt Enable Set Register */

#define NVMCTRL_INTENSET_READY_Pos     0         /**< \brief (NVMCTRL_INTENSET) NVM Ready Interrupt Enable */
#define NVMCTRL_INTENSET_READY         ( 0x1u << NVMCTRL_INTENSET_READY_Pos )
#define NVMCTRL_INTENSET_ERROR_Pos     1         /**< \brief (NVMCTRL_INTENSET) Error Interrupt Enable */
#define NVMCTRL_INTENSET_ERROR         ( 0x1u << NVMCTRL_INTENSET_ERROR_Pos )
#define NVMCTRL_INTENSET_MASK          0x03u     /**< \brief (NVMCTRL_INTENSET) MASK Register */

/* -------- NVMCTRL_INTFLAG : (NVMCTRL Offset: 0x14) (R/W  8) Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t READY : 1; /*!< bit:      0  NVM Ready Interrupt Flag           */
            uint8_t ERROR : 1; /*!< bit:      1  Error Interrupt Flag               */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } NVMCTRL_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_INTFLAG_OFFSET        0x14       /**< \brief (NVMCTRL_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define NVMCTRL_INTFLAG_RESETVALUE    0x00       /**< \brief (NVMCTRL_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define NVMCTRL_INTFLAG_READY_Pos     0          /**< \brief (NVMCTRL_INTFLAG) NVM Ready Interrupt Flag */
#define NVMCTRL_INTFLAG_READY         ( 0x1u << NVMCTRL_INTFLAG_READY_Pos )
#define NVMCTRL_INTFLAG_ERROR_Pos     1          /**< \brief (NVMCTRL_INTFLAG) Error Interrupt Flag */
#define NVMCTRL_INTFLAG_ERROR         ( 0x1u << NVMCTRL_INTFLAG_ERROR_Pos )
#define NVMCTRL_INTFLAG_MASK          0x03u      /**< \brief (NVMCTRL_INTFLAG) MASK Register */

/* -------- NVMCTRL_STATUS : (NVMCTRL Offset: 0x18) (R/W 16) Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t PRM : 1;   /*!< bit:      0  Power Reduction Mode               */
            uint16_t LOAD : 1;  /*!< bit:      1  NVM Page Buffer Active Loading     */
            uint16_t PROGE : 1; /*!< bit:      2  Programming Error Status           */
            uint16_t LOCKE : 1; /*!< bit:      3  Lock Error Status                  */
            uint16_t NVME : 1;  /*!< bit:      4  NVM Error                          */
            uint16_t : 3;       /*!< bit:  5.. 7  Reserved                           */
            uint16_t SB : 1;    /*!< bit:      8  Security Bit Status                */
            uint16_t : 7;       /*!< bit:  9..15  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } NVMCTRL_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_STATUS_OFFSET        0x18        /**< \brief (NVMCTRL_STATUS offset) Status Register */
#define NVMCTRL_STATUS_RESETVALUE    0x0000      /**< \brief (NVMCTRL_STATUS reset_value) Status Register */

#define NVMCTRL_STATUS_PRM_Pos       0           /**< \brief (NVMCTRL_STATUS) Power Reduction Mode */
#define NVMCTRL_STATUS_PRM           ( 0x1u << NVMCTRL_STATUS_PRM_Pos )
#define NVMCTRL_STATUS_LOAD_Pos      1           /**< \brief (NVMCTRL_STATUS) NVM Page Buffer Active Loading */
#define NVMCTRL_STATUS_LOAD          ( 0x1u << NVMCTRL_STATUS_LOAD_Pos )
#define NVMCTRL_STATUS_PROGE_Pos     2           /**< \brief (NVMCTRL_STATUS) Programming Error Status */
#define NVMCTRL_STATUS_PROGE         ( 0x1u << NVMCTRL_STATUS_PROGE_Pos )
#define NVMCTRL_STATUS_LOCKE_Pos     3           /**< \brief (NVMCTRL_STATUS) Lock Error Status */
#define NVMCTRL_STATUS_LOCKE         ( 0x1u << NVMCTRL_STATUS_LOCKE_Pos )
#define NVMCTRL_STATUS_NVME_Pos      4           /**< \brief (NVMCTRL_STATUS) NVM Error */
#define NVMCTRL_STATUS_NVME          ( 0x1u << NVMCTRL_STATUS_NVME_Pos )
#define NVMCTRL_STATUS_SB_Pos        8           /**< \brief (NVMCTRL_STATUS) Security Bit Status */
#define NVMCTRL_STATUS_SB            ( 0x1u << NVMCTRL_STATUS_SB_Pos )
#define NVMCTRL_STATUS_MASK          0x011Fu     /**< \brief (NVMCTRL_STATUS) MASK Register */

/* -------- NVMCTRL_ADDR : (NVMCTRL Offset: 0x1C) (R/W 32) Address Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t ADDR : 22; /*!< bit:  0..21  NVM Address                        */
            uint32_t : 10;      /*!< bit: 22..31  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } NVMCTRL_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_ADDR_OFFSET        0x1C          /**< \brief (NVMCTRL_ADDR offset) Address Register */
#define NVMCTRL_ADDR_RESETVALUE    0x00000000    /**< \brief (NVMCTRL_ADDR reset_value) Address Register */

