FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_nvmctrl.h
#define NVMCTRL_ADDR_ADDR_Pos      0             /**< \brief (NVMCTRL_ADDR) NVM Address */
#define NVMCTRL_ADDR_ADDR_Msk      ( 0x3FFFFFu << NVMCTRL_ADDR_ADDR_Pos )
#define NVMCTRL_ADDR_ADDR( value )    ( ( NVMCTRL_ADDR_ADDR_Msk & ( ( value ) << NVMCTRL_ADDR_ADDR_Pos ) ) )
#define NVMCTRL_ADDR_MASK          0x003FFFFFu   /**< \brief (NVMCTRL_ADDR) MASK Register */

/* -------- NVMCTRL_LOCK : (NVMCTRL Offset: 0x20) (R/W 16) Lock Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t LOCK : 16; /*!< bit:  0..15  Region Lock Bits                   */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } NVMCTRL_LOCK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define NVMCTRL_LOCK_OFFSET        0x20          /**< \brief (NVMCTRL_LOCK offset) Lock Register */
#define NVMCTRL_LOCK_RESETVALUE    0x0000        /**< \brief (NVMCTRL_LOCK reset_value) Lock Register */

#define NVMCTRL_LOCK_LOCK_Pos      0             /**< \brief (NVMCTRL_LOCK) Region Lock Bits */
#define NVMCTRL_LOCK_LOCK_Msk      ( 0xFFFFu << NVMCTRL_LOCK_LOCK_Pos )
#define NVMCTRL_LOCK_LOCK( value )    ( ( NVMCTRL_LOCK_LOCK_Msk & ( ( value ) << NVMCTRL_LOCK_LOCK_Pos ) ) )
#define NVMCTRL_LOCK_MASK          0xFFFFu       /**< \brief (NVMCTRL_LOCK) MASK Register */

/** \brief NVMCTRL hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __IO NVMCTRL_CTRLA_Type CTRLA;        /**< \brief Offset: 0x00 (R/W 16) NVM Control Register A */
        RoReg8 Reserved1[ 0x2 ];
        __IO NVMCTRL_CTRLB_Type CTRLB;        /**< \brief Offset: 0x04 (R/W 32) NVM Control Register B */
        __IO NVMCTRL_PARAM_Type PARAM;        /**< \brief Offset: 0x08 (R/W 32) Parameter Register */
        __IO NVMCTRL_INTENCLR_Type INTENCLR;  /**< \brief Offset: 0x0C (R/W  8) Interrupt Enable Clear Register */
        RoReg8 Reserved2[ 0x3 ];
        __IO NVMCTRL_INTENSET_Type INTENSET;  /**< \brief Offset: 0x10 (R/W  8) Interrupt Enable Set Register */
        RoReg8 Reserved3[ 0x3 ];
        __IO NVMCTRL_INTFLAG_Type INTFLAG;    /**< \brief Offset: 0x14 (R/W  8) Interrupt Flag Status and Clear Register */
        RoReg8 Reserved4[ 0x3 ];
        __IO NVMCTRL_STATUS_Type STATUS;      /**< \brief Offset: 0x18 (R/W 16) Status Register */
        RoReg8 Reserved5[ 0x2 ];
        __IO NVMCTRL_ADDR_Type ADDR;          /**< \brief Offset: 0x1C (R/W 32) Address Register */
        __IO NVMCTRL_LOCK_Type LOCK;          /**< \brief Offset: 0x20 (R/W 16) Lock Register */
    } Nvmctrl;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR NON-VOLATILE FUSES */
/* ************************************************************************** */
/** \addtogroup fuses_api Peripheral Software API */
/*@{*/


#define ADC_FUSES_BIASCAL_ADDR               ( NVMCTRL_OTP4 + 4 )
#define ADC_FUSES_BIASCAL_Pos                3   /**< \brief (NVMCTRL_OTP4) ADC Bias Calibration */
#define ADC_FUSES_BIASCAL_Msk                ( 0x7u << ADC_FUSES_BIASCAL_Pos )
#define ADC_FUSES_BIASCAL( value )    ( ( ADC_FUSES_BIASCAL_Msk & ( ( value ) << ADC_FUSES_BIASCAL_Pos ) ) )

#define ADC_FUSES_BIAS_OPA_ADDR              ( NVMCTRL_OTP2 + 4 )
#define ADC_FUSES_BIAS_OPA_Pos               19  /**< \brief (NVMCTRL_OTP2) ADC OPA Bias */
#define ADC_FUSES_BIAS_OPA_Msk               ( 0x1u << ADC_FUSES_BIAS_OPA_Pos )

#define ADC_FUSES_BOOSTEN_ADDR               ( NVMCTRL_OTP2 + 4 )
#define ADC_FUSES_BOOSTEN_Pos                17  /**< \brief (NVMCTRL_OTP2) ADC Boost Enable */
#define ADC_FUSES_BOOSTEN_Msk                ( 0x1u << ADC_FUSES_BOOSTEN_Pos )

#define ADC_FUSES_CMPDELAY_ADDR              ( NVMCTRL_OTP2 + 4 )
#define ADC_FUSES_CMPDELAY_Pos               16  /**< \brief (NVMCTRL_OTP2) ADC Comparator Delay */
#define ADC_FUSES_CMPDELAY_Msk               ( 0x1u << ADC_FUSES_CMPDELAY_Pos )

#define ADC_FUSES_DCFG_ADDR                  ( NVMCTRL_OTP2 + 4 )
#define ADC_FUSES_DCFG_Pos                   16  /**< \brief (NVMCTRL_OTP2) ADC Device Configuration */
#define ADC_FUSES_DCFG_Msk                   ( 0xFu << ADC_FUSES_DCFG_Pos )
#define ADC_FUSES_DCFG( value )    ( ( ADC_FUSES_DCFG_Msk & ( ( value ) << ADC_FUSES_DCFG_Pos ) ) )

#define ADC_FUSES_GAINCORR_ADDR              NVMCTRL_OTP4
#define ADC_FUSES_GAINCORR_Pos               3   /**< \brief (NVMCTRL_OTP4) ADC Gain Correction */
#define ADC_FUSES_GAINCORR_Msk               ( 0xFFFu << ADC_FUSES_GAINCORR_Pos )
#define ADC_FUSES_GAINCORR( value )    ( ( ADC_FUSES_GAINCORR_Msk & ( ( value ) << ADC_FUSES_GAINCORR_Pos ) ) )

#define ADC_FUSES_LINEARITY_0_ADDR           NVMCTRL_OTP4
#define ADC_FUSES_LINEARITY_0_Pos            27  /**< \brief (NVMCTRL_OTP4) ADC Linearity bits 4:0 */
#define ADC_FUSES_LINEARITY_0_Msk            ( 0x1Fu << ADC_FUSES_LINEARITY_0_Pos )
#define ADC_FUSES_LINEARITY_0( value )    ( ( ADC_FUSES_LINEARITY_0_Msk & ( ( value ) << ADC_FUSES_LINEARITY_0_Pos ) ) )

#define ADC_FUSES_LINEARITY_1_ADDR           ( NVMCTRL_OTP4 + 4 )
#define ADC_FUSES_LINEARITY_1_Pos            0   /**< \brief (NVMCTRL_OTP4) ADC Linearity bits 7:5 */
#define ADC_FUSES_LINEARITY_1_Msk            ( 0x7u << ADC_FUSES_LINEARITY_1_Pos )
#define ADC_FUSES_LINEARITY_1( value )    ( ( ADC_FUSES_LINEARITY_1_Msk & ( ( value ) << ADC_FUSES_LINEARITY_1_Pos ) ) )

#define ADC_FUSES_OFFSETCORR_ADDR            NVMCTRL_OTP4
#define ADC_FUSES_OFFSETCORR_Pos             15  /**< \brief (NVMCTRL_OTP4) ADC Offset Correction */
#define ADC_FUSES_OFFSETCORR_Msk             ( 0xFFFu << ADC_FUSES_OFFSETCORR_Pos )
#define ADC_FUSES_OFFSETCORR( value )    ( ( ADC_FUSES_OFFSETCORR_Msk & ( ( value ) << ADC_FUSES_OFFSETCORR_Pos ) ) )

#define ADC_FUSES_VCMPULSE_ADDR              ( NVMCTRL_OTP2 + 4 )
#define ADC_FUSES_VCMPULSE_Pos               18  /**< \brief (NVMCTRL_OTP2) ADC VCM Pulse */
#define ADC_FUSES_VCMPULSE_Msk               ( 0x1u << ADC_FUSES_VCMPULSE_Pos )

#define DSU_FUSES_DCFG0_ADDR                 NVMCTRL_OTP2
#define DSU_FUSES_DCFG0_Pos                  0   /**< \brief (NVMCTRL_OTP2) Device Configuration 0 */
#define DSU_FUSES_DCFG0_Msk                  ( 0xFFFFFFFFu << DSU_FUSES_DCFG0_Pos )
#define DSU_FUSES_DCFG0( value )    ( ( DSU_FUSES_DCFG0_Msk & ( ( value ) << DSU_FUSES_DCFG0_Pos ) ) )

#define DSU_FUSES_DCFG1_ADDR                 ( NVMCTRL_OTP2 + 4 )
#define DSU_FUSES_DCFG1_Pos                  0   /**< \brief (NVMCTRL_OTP2) Device Configuration 1 */
#define DSU_FUSES_DCFG1_Msk                  ( 0xFFFFFFFFu << DSU_FUSES_DCFG1_Pos )
#define DSU_FUSES_DCFG1( value )    ( ( DSU_FUSES_DCFG1_Msk & ( ( value ) << DSU_FUSES_DCFG1_Pos ) ) )

