FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_nvmctrl.h
#define DSU_FUSES_DEV_FAMILY_CFG_0_ADDR      NVMCTRL_OTP2
#define DSU_FUSES_DEV_FAMILY_CFG_0_Pos       5      /**< \brief (NVMCTRL_OTP2) Device Family Configuration bits 26:0 */
#define DSU_FUSES_DEV_FAMILY_CFG_0_Msk       ( 0x7FFFFFFu << DSU_FUSES_DEV_FAMILY_CFG_0_Pos )
#define DSU_FUSES_DEV_FAMILY_CFG_0( value )    ( ( DSU_FUSES_DEV_FAMILY_CFG_0_Msk & ( ( value ) << DSU_FUSES_DEV_FAMILY_CFG_0_Pos ) ) )

#define DSU_FUSES_DEV_FAMILY_CFG_1_ADDR      ( NVMCTRL_OTP2 + 4 )
#define DSU_FUSES_DEV_FAMILY_CFG_1_Pos       0      /**< \brief (NVMCTRL_OTP2) Device Family Configuration bits 42:27 */
#define DSU_FUSES_DEV_FAMILY_CFG_1_Msk       ( 0xFFFFu << DSU_FUSES_DEV_FAMILY_CFG_1_Pos )
#define DSU_FUSES_DEV_FAMILY_CFG_1( value )    ( ( DSU_FUSES_DEV_FAMILY_CFG_1_Msk & ( ( value ) << DSU_FUSES_DEV_FAMILY_CFG_1_Pos ) ) )

#define DSU_FUSES_DID_DEVSEL_ADDR            NVMCTRL_OTP2
#define DSU_FUSES_DID_DEVSEL_Pos             0   /**< \brief (NVMCTRL_OTP2) Device Number */
#define DSU_FUSES_DID_DEVSEL_Msk             ( 0x1Fu << DSU_FUSES_DID_DEVSEL_Pos )
#define DSU_FUSES_DID_DEVSEL( value )    ( ( DSU_FUSES_DID_DEVSEL_Msk & ( ( value ) << DSU_FUSES_DID_DEVSEL_Pos ) ) )

#define DSU_FUSES_RAM_BIAS_ADDR              ( NVMCTRL_OTP2 + 4 )
#define DSU_FUSES_RAM_BIAS_Pos               20  /**< \brief (NVMCTRL_OTP2) RAM Bias */
#define DSU_FUSES_RAM_BIAS_Msk               ( 0x3u << DSU_FUSES_RAM_BIAS_Pos )
#define DSU_FUSES_RAM_BIAS( value )    ( ( DSU_FUSES_RAM_BIAS_Msk & ( ( value ) << DSU_FUSES_RAM_BIAS_Pos ) ) )

#define DSU_FUSES_RAM_READ_MARGIN_ADDR       ( NVMCTRL_OTP2 + 4 )
#define DSU_FUSES_RAM_READ_MARGIN_Pos        22    /**< \brief (NVMCTRL_OTP2) RAM Read Margin */
#define DSU_FUSES_RAM_READ_MARGIN_Msk        ( 0xFu << DSU_FUSES_RAM_READ_MARGIN_Pos )
#define DSU_FUSES_RAM_READ_MARGIN( value )    ( ( DSU_FUSES_RAM_READ_MARGIN_Msk & ( ( value ) << DSU_FUSES_RAM_READ_MARGIN_Pos ) ) )

#define NVMCTRL_FUSES_BOOTPROT_ADDR          NVMCTRL_USER
#define NVMCTRL_FUSES_BOOTPROT_Pos           0   /**< \brief (NVMCTRL_USER) Bootloader Size */
#define NVMCTRL_FUSES_BOOTPROT_Msk           ( 0x7u << NVMCTRL_FUSES_BOOTPROT_Pos )
#define NVMCTRL_FUSES_BOOTPROT( value )    ( ( NVMCTRL_FUSES_BOOTPROT_Msk & ( ( value ) << NVMCTRL_FUSES_BOOTPROT_Pos ) ) )

#define NVMCTRL_FUSES_EEPROM_SIZE_ADDR       NVMCTRL_USER
#define NVMCTRL_FUSES_EEPROM_SIZE_Pos        4     /**< \brief (NVMCTRL_USER) EEPROM Size */
#define NVMCTRL_FUSES_EEPROM_SIZE_Msk        ( 0x7u << NVMCTRL_FUSES_EEPROM_SIZE_Pos )
#define NVMCTRL_FUSES_EEPROM_SIZE( value )    ( ( NVMCTRL_FUSES_EEPROM_SIZE_Msk & ( ( value ) << NVMCTRL_FUSES_EEPROM_SIZE_Pos ) ) )

#define NVMCTRL_FUSES_LOCKFIELD_ADDR         NVMCTRL_LOCKBIT
#define NVMCTRL_FUSES_LOCKFIELD_Pos          0   /**< \brief (NVMCTRL_LOCKBIT) LOCK Region */
#define NVMCTRL_FUSES_LOCKFIELD_Msk          ( 0xFFu << NVMCTRL_FUSES_LOCKFIELD_Pos )
#define NVMCTRL_FUSES_LOCKFIELD( value )    ( ( NVMCTRL_FUSES_LOCKFIELD_Msk & ( ( value ) << NVMCTRL_FUSES_LOCKFIELD_Pos ) ) )

#define NVMCTRL_FUSES_NVMP_ADDR              NVMCTRL_OTP1
#define NVMCTRL_FUSES_NVMP_Pos               16  /**< \brief (NVMCTRL_OTP1) Number of NVM Pages */
#define NVMCTRL_FUSES_NVMP_Msk               ( 0xFFFFu << NVMCTRL_FUSES_NVMP_Pos )
#define NVMCTRL_FUSES_NVMP( value )    ( ( NVMCTRL_FUSES_NVMP_Msk & ( ( value ) << NVMCTRL_FUSES_NVMP_Pos ) ) )

#define NVMCTRL_FUSES_NVM_LOCK_ADDR          NVMCTRL_OTP1
#define NVMCTRL_FUSES_NVM_LOCK_Pos           0   /**< \brief (NVMCTRL_OTP1) NVM Lock */
#define NVMCTRL_FUSES_NVM_LOCK_Msk           ( 0xFFu << NVMCTRL_FUSES_NVM_LOCK_Pos )
#define NVMCTRL_FUSES_NVM_LOCK( value )    ( ( NVMCTRL_FUSES_NVM_LOCK_Msk & ( ( value ) << NVMCTRL_FUSES_NVM_LOCK_Pos ) ) )

#define NVMCTRL_FUSES_PSZ_ADDR               NVMCTRL_OTP1
#define NVMCTRL_FUSES_PSZ_Pos                8   /**< \brief (NVMCTRL_OTP1) NVM Page Size */
#define NVMCTRL_FUSES_PSZ_Msk                ( 0xFu << NVMCTRL_FUSES_PSZ_Pos )
#define NVMCTRL_FUSES_PSZ( value )    ( ( NVMCTRL_FUSES_PSZ_Msk & ( ( value ) << NVMCTRL_FUSES_PSZ_Pos ) ) )

#define NVMCTRL_FUSES_REGION_LOCKS_ADDR      ( NVMCTRL_USER + 4 )
#define NVMCTRL_FUSES_REGION_LOCKS_Pos       16     /**< \brief (NVMCTRL_USER) NVM Region Locks */
#define NVMCTRL_FUSES_REGION_LOCKS_Msk       ( 0xFFFFu << NVMCTRL_FUSES_REGION_LOCKS_Pos )
#define NVMCTRL_FUSES_REGION_LOCKS( value )    ( ( NVMCTRL_FUSES_REGION_LOCKS_Msk & ( ( value ) << NVMCTRL_FUSES_REGION_LOCKS_Pos ) ) )

#define SYSCTRL_FUSES_OSC32KCAL_ADDR         ( NVMCTRL_OTP4 + 4 )
#define SYSCTRL_FUSES_OSC32KCAL_Pos          6      /**< \brief (NVMCTRL_OTP4) OSC32K Calibration */
#define SYSCTRL_FUSES_OSC32KCAL_Msk          ( 0x7Fu << SYSCTRL_FUSES_OSC32KCAL_Pos )
#define SYSCTRL_FUSES_OSC32KCAL( value )    ( ( SYSCTRL_FUSES_OSC32KCAL_Msk & ( ( value ) << SYSCTRL_FUSES_OSC32KCAL_Pos ) ) )

#define SYSCTRL_FUSES_BOD12USERLEVEL_ADDR    NVMCTRL_USER
#define SYSCTRL_FUSES_BOD12USERLEVEL_Pos     17       /**< \brief (NVMCTRL_USER) BOD12 User Level */
#define SYSCTRL_FUSES_BOD12USERLEVEL_Msk     ( 0x1Fu << SYSCTRL_FUSES_BOD12USERLEVEL_Pos )
#define SYSCTRL_FUSES_BOD12USERLEVEL( value )    ( ( SYSCTRL_FUSES_BOD12USERLEVEL_Msk & ( ( value ) << SYSCTRL_FUSES_BOD12USERLEVEL_Pos ) ) )

#define SYSCTRL_FUSES_BOD12_ACTION_ADDR      NVMCTRL_USER
#define SYSCTRL_FUSES_BOD12_ACTION_Pos       23     /**< \brief (NVMCTRL_USER) BOD12 Action */
#define SYSCTRL_FUSES_BOD12_ACTION_Msk       ( 0x3u << SYSCTRL_FUSES_BOD12_ACTION_Pos )
#define SYSCTRL_FUSES_BOD12_ACTION( value )    ( ( SYSCTRL_FUSES_BOD12_ACTION_Msk & ( ( value ) << SYSCTRL_FUSES_BOD12_ACTION_Pos ) ) )

#define SYSCTRL_FUSES_BOD12_EN_ADDR          NVMCTRL_USER
#define SYSCTRL_FUSES_BOD12_EN_Pos           22  /**< \brief (NVMCTRL_USER) BOD12 Enable */
#define SYSCTRL_FUSES_BOD12_EN_Msk           ( 0x1u << SYSCTRL_FUSES_BOD12_EN_Pos )

#define SYSCTRL_FUSES_BOD33USERLEVEL_ADDR    NVMCTRL_USER
#define SYSCTRL_FUSES_BOD33USERLEVEL_Pos     8        /**< \brief (NVMCTRL_USER) BOD33 User Level */
#define SYSCTRL_FUSES_BOD33USERLEVEL_Msk     ( 0x3Fu << SYSCTRL_FUSES_BOD33USERLEVEL_Pos )
#define SYSCTRL_FUSES_BOD33USERLEVEL( value )    ( ( SYSCTRL_FUSES_BOD33USERLEVEL_Msk & ( ( value ) << SYSCTRL_FUSES_BOD33USERLEVEL_Pos ) ) )

#define SYSCTRL_FUSES_BOD33_ACTION_ADDR      NVMCTRL_USER
#define SYSCTRL_FUSES_BOD33_ACTION_Pos       15     /**< \brief (NVMCTRL_USER) BOD33 Action */
#define SYSCTRL_FUSES_BOD33_ACTION_Msk       ( 0x3u << SYSCTRL_FUSES_BOD33_ACTION_Pos )
#define SYSCTRL_FUSES_BOD33_ACTION( value )    ( ( SYSCTRL_FUSES_BOD33_ACTION_Msk & ( ( value ) << SYSCTRL_FUSES_BOD33_ACTION_Pos ) ) )

#define SYSCTRL_FUSES_BOD33_EN_ADDR          NVMCTRL_USER
#define SYSCTRL_FUSES_BOD33_EN_Pos           14  /**< \brief (NVMCTRL_USER) BOD33 Enable */
#define SYSCTRL_FUSES_BOD33_EN_Msk           ( 0x1u << SYSCTRL_FUSES_BOD33_EN_Pos )

#define SYSCTRL_FUSES_ULPVREG_ADDR           NVMCTRL_OTP4
#define SYSCTRL_FUSES_ULPVREG_Pos            0   /**< \brief (NVMCTRL_OTP4) ULP Regulator Fallback Mode */
#define SYSCTRL_FUSES_ULPVREG_Msk            ( 0x7u << SYSCTRL_FUSES_ULPVREG_Pos )
#define SYSCTRL_FUSES_ULPVREG( value )    ( ( SYSCTRL_FUSES_ULPVREG_Msk & ( ( value ) << SYSCTRL_FUSES_ULPVREG_Pos ) ) )

