FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_nvmctrl.h
#define WDT_FUSES_ALWAYSON_ADDR              NVMCTRL_USER
#define WDT_FUSES_ALWAYSON_Pos               26  /**< \brief (NVMCTRL_USER) WDT Always On */
#define WDT_FUSES_ALWAYSON_Msk               ( 0x1u << WDT_FUSES_ALWAYSON_Pos )

#define WDT_FUSES_ENABLE_ADDR                NVMCTRL_USER
#define WDT_FUSES_ENABLE_Pos                 25  /**< \brief (NVMCTRL_USER) WDT Enable */
#define WDT_FUSES_ENABLE_Msk                 ( 0x1u << WDT_FUSES_ENABLE_Pos )

#define WDT_FUSES_EWOFFSET_ADDR              ( NVMCTRL_USER + 4 )
#define WDT_FUSES_EWOFFSET_Pos               3   /**< \brief (NVMCTRL_USER) WDT Early Warning Offset */
#define WDT_FUSES_EWOFFSET_Msk               ( 0xFu << WDT_FUSES_EWOFFSET_Pos )
#define WDT_FUSES_EWOFFSET( value )    ( ( WDT_FUSES_EWOFFSET_Msk & ( ( value ) << WDT_FUSES_EWOFFSET_Pos ) ) )

#define WDT_FUSES_PER_ADDR                   NVMCTRL_USER
#define WDT_FUSES_PER_Pos                    27  /**< \brief (NVMCTRL_USER) WDT Period */
#define WDT_FUSES_PER_Msk                    ( 0xFu << WDT_FUSES_PER_Pos )
#define WDT_FUSES_PER( value )    ( ( WDT_FUSES_PER_Msk & ( ( value ) << WDT_FUSES_PER_Pos ) ) )

#define WDT_FUSES_WEN_ADDR                   ( NVMCTRL_USER + 4 )
#define WDT_FUSES_WEN_Pos                    7   /**< \brief (NVMCTRL_USER) WDT Window Mode Enable */
#define WDT_FUSES_WEN_Msk                    ( 0x1u << WDT_FUSES_WEN_Pos )

#define WDT_FUSES_WINDOW_0_ADDR              NVMCTRL_USER
#define WDT_FUSES_WINDOW_0_Pos               31  /**< \brief (NVMCTRL_USER) WDT Window bit 0 */
#define WDT_FUSES_WINDOW_0_Msk               ( 0x1u << WDT_FUSES_WINDOW_0_Pos )

#define WDT_FUSES_WINDOW_1_ADDR              ( NVMCTRL_USER + 4 )
#define WDT_FUSES_WINDOW_1_Pos               0   /**< \brief (NVMCTRL_USER) WDT Window bits 3:1 */
#define WDT_FUSES_WINDOW_1_Msk               ( 0x7u << WDT_FUSES_WINDOW_1_Pos )
#define WDT_FUSES_WINDOW_1( value )    ( ( WDT_FUSES_WINDOW_1_Msk & ( ( value ) << WDT_FUSES_WINDOW_1_Pos ) ) )

/*@}*/

#endif /* _SAMD20_NVMCTRL_COMPONENT_ */
